ext_alsav/Catalogs/ВариантыКомплектацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыКомплектацииНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДлительностьСборкиРазборки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностиКомплектацииПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоМатериалы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЭтоПолуфабрикат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВариантКомлектации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext_alsav/InformationRegisters/алсав_ПроверкаВнешнихФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>алсав_ПроверкаВнешнихФайлов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлНайден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайлаМегаБайты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/Catalogs/ВариантыКомплектацииНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура алсав_ФайлСметыНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НастройкиДиалога = Новый Структура;
	НастройкиДиалога.Вставить("Заголовок", НСтр("ru=’Выберите файл сметы (Excel)'"));
	НастройкиДиалога.Вставить("Фильтр", НСтр("*.xls"));
	ОбменДаннымиКлиент.ОбработчикВыбораФайла(ЭтотОбъект, "ФайлСметы", СтандартнаяОбработка, НастройкиДиалога);    
КонецПроцедуры

&НаКлиенте
Процедура алсав_ФайлМоделиНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	НастройкиДиалога = Новый Структура;
	НастройкиДиалога.Вставить("Заголовок", НСтр("ru=’Выберите файл модели)'"));
	ОбменДаннымиКлиент.ОбработчикВыбораФайла(ЭтотОбъект, "ФайлМодели", СтандартнаяОбработка, НастройкиДиалога);
КонецПроцедуры

&НаСервере
Процедура алсав_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		ЭтаФорма.ФайлСметы = алсав_ДопРеквизиты.ПолучитьДопСведение(ТекущийОбъект.Ссылка,"Файл сметы");
		ЭтаФорма.ФайлМодели = алсав_ДопРеквизиты.ПолучитьДопСведение(ТекущийОбъект.Ссылка,"Файл модели");
		ЭтаФорма.Описание = алсав_ДопРеквизиты.ПолучитьДопСведение(ТекущийОбъект.Ссылка,"Описание");
		
		ВыполнитьПроверкуКорректностиДанных();
	КонецЕсли;
	
	Элементы.Основной.ТолькоПросмотр = Объект.ЭтоМатериалы;
КонецПроцедуры

&НаСервере
Процедура алсав_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	алсав_ДопРеквизиты.УстановитьЗначениеДопСведения(ТекущийОбъект.Ссылка,"Файл сметы",ЭтаФорма.ФайлСметы);
	алсав_ДопРеквизиты.УстановитьЗначениеДопСведения(ТекущийОбъект.Ссылка,"Файл модели",ЭтаФорма.ФайлМодели);
	алсав_ДопРеквизиты.УстановитьЗначениеДопСведения(ТекущийОбъект.Ссылка,"Описание",ЭтаФорма.Описание);
	
	РегистрыСведений.алсав_ПроверкаВнешнихФайлов.ВыполнитьПроверки("ВариантыКомплектацииНоменклатуры", "Файл сметы", ЭтаФорма.Объект.Ссылка);
	РегистрыСведений.алсав_ПроверкаВнешнихФайлов.ВыполнитьПроверки("ВариантыКомплектацииНоменклатуры", "Файл модели", ЭтаФорма.Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура алсав_ЗагрузитьИзСметыПосле(Команда)
	// Вставить содержимое обработчика.
	
	ЭтаФорма.Модифицированность = Истина;
	
	ДобавитьЛог("чтение файла на клиенте");
	Файл = Новый ДвоичныеДанные(ЭтаФорма.ФайлСметы);	
	ДобавитьЛог("файл прочитан");
	ДобавитьЛог("отправление на сервер");
	
	Объект.Товары.Очистить();
	
	Адрес = ПоместитьВоВременноеХранилище(Файл, ЭтаФорма.УникальныйИдентификатор);
	данные = алсав_ЗагрузитьИзСметыВМассивСтруктур(Адрес,ЭтаФорма.ФайлСметы);
	
	позиция = 0;
	Для Каждого эл Из данные Цикл
		позиция = позиция + 1;
		Если ЗначениеЗаполнено(эл.Артикул) Тогда
			номен = ПолучитьНоменклатуруПоАртикулу(эл.Артикул);
			упаковка = ПолучитьЕдИзм(эл.ЕдИзм);
			Если ЗначениеЗаполнено(номен) Тогда			
				нСтр = Объект.Товары.Добавить();
				Элементы.Товары.ТекущаяСтрока = нСтр.ПолучитьИдентификатор();
				
				нСтр.Номенклатура = номен;
				ТоварыНоменклатураПриИзменении(Элементы.Товары);
				
				нСтр.Упаковка = упаковка;
				ТоварыУпаковкаПриИзменении(Элементы.Товары);
				
				нСтр.КоличествоУпаковок = Число(эл.РасчетноеКоличество);
				нСтр.Количество = Число(эл.РасчетноеКоличество);
				
				ТоварыКоличествоУпаковокПриИзменении(Элементы.Товары);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(номен) Тогда 
				Сообщить("["+позиция+"] Не найдена номенклатура Артикул ["+эл.Артикул+"]")
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(упаковка) Тогда
				Сообщить("["+позиция+"] Не найдена ед.изм.["+эл.ЕдИзм+"]")
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;
	
	
	
	
	//Пока 1 =1 Цикл
	//	артикул = СокрЛП(таблДок.Область(номерСтроки,1,номерСтроки,1).Текст);
	//	количество = СокрЛП(таблДок.Область(номерСтроки,3,номерСтроки,3).Текст);
	//	едИзм = СокрЛП(таблДок.Область(номерСтроки,4,номерСтроки,4).Текст);
	//	
	//	Если ЗначениеЗаполнено(артикул) Тогда
	//		номен = ПолучитьНоменклатуруПоАртикулу(артикул);
	//		упаковка = ПолучитьЕдИзм(едИзм);
	//		количество = Число(количество);
	//		
	//		Если ЗначениеЗаполнено(номен) Тогда
	//			
	//			нСтр = Объект.Товары.Добавить();
	//			Элементы.Товары.ТекущаяСтрока = нСтр.ПолучитьИдентификатор();
	//			
	//			нСтр.Номенклатура = номен;
	//			ТоварыНоменклатураПриИзменении(Элементы.Товары);
	//			
	//			нСтр.Упаковка = упаковка;
	//			ТоварыУпаковкаПриИзменении(Элементы.Товары);
	//			
	//			нСтр.КоличествоУпаковок = количество;
	//			нСтр.Количество = количество;
	//			ТоварыКоличествоУпаковокПриИзменении(Элементы.Товары);
	//		КонецЕсли;
	//		
	//		позиция = (номерСтроки-началоТаблицы);
	//		Если НЕ ЗначениеЗаполнено(номен) Тогда 
	//			Сообщить("["+позиция+"] Не найдена номенклатура Артикул ["+артикул+"]")
	//		КонецЕсли;
	//		Если НЕ ЗначениеЗаполнено(упаковка) Тогда
	//			Сообщить("["+позиция+"] Не найдена ед.изм.["+едИзм+"]")
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//	
	//	номерСтроки = номерСтроки+1;
	//	Если НЕ ЗначениеЗаполнено(таблДок.Область(номерСтроки,2,номерСтроки,2).Текст) Тогда
	//		BREAK;
	//	КонецЕсли;
	//КонецЦикла; 
	//
	ВыполнитьПроверкуКорректностиДанных();
КонецПроцедуры

&НаСервере
Функция ВыполнитьПроверкуКорректностиДанных()
	Для Каждого Стр из Объект.Товары Цикл
		Стр.ОшибкаЕдИзм = (ЗначениеЗаполнено(Стр.Упаковка))И(Стр.Упаковка <> Стр.Номенклатура.ЕдиницаИзмерения);
		Если Стр.ОшибкаЕдИзм Тогда
			Сообщить("["+Стр.НомерСтроки+"] Есть несоотвествие ед.изм. со справочником номенклатуры");
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЕдИзм(наименование)
	Запрос = Новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	               |ГДЕ
	               |	УпаковкиЕдиницыИзмерения.Наименование = &наименование
				   |	И УпаковкиЕдиницыИзмерения.Владелец = &Владелец
	               |	И НЕ УпаковкиЕдиницыИзмерения.ПометкаУдаления";
	Запрос.УстановитьПараметр("наименование",наименование);
	Запрос.УстановитьПараметр("Владелец",Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения);
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Возврат рез.ССылка;
	КонецЕсли;
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьНоменклатуруПоАртикулу(артикул)
	Возврат Справочники.Номенклатура.ПолучитьНоменклатуруПоАртикулу(артикул);
КонецФункции

&НаСервереБезКонтекста
Функция алсав_ЗагрузитьИзСметыВМассивСтруктур(Адрес, исходныйФайл)
	
	Возврат Справочники.ВариантыКомплектацииНоменклатуры.алсав_ЗагрузитьИзСметыВМассивСтруктур(Адрес, исходныйФайл);
	
КонецФункции


&НаСервере
Функция ДобавитьЛог(текст)
	ЭтаФорма.Лог = "["+ТекущаяДата()+"]"+текст+Символы.ПС+ЭтаФорма.Лог;
конецФункции

&НаСервере
Процедура алсав_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
	ВыполнитьПроверкуКорректностиДанных();
	тест =Объект.Товары.НайтиСтроки(Новый Структура("ОшибкаЕдИзм",Истина));
	Если тест.Количество() > 0 Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
//&После("УстановитьУсловноеОформление")
Процедура алсав_УстановитьУсловноеОформление()
	ИмяПоляВводаЕдиницИзмерения = "ТоварыНоменклатураЕдиницаИзмерения";
	ПутьКПолюОтбора = "Объект.Товары.ОшибкаЕдИзм";
	ЭлементыФормы = ЭтаФорма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаЕдиницИзмерения].Имя);

	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ПравоеЗначение = истина;
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
КонецПроцедуры

&НаСервере
&Вместо("УстановитьУсловноеОформление")
Процедура алсав_УстановитьУсловноеОформление1()
	// Вставить содержимое метода.
	//ПродолжитьВызов();
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма);
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура алсав_ЭтоМатериалыПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
	Элементы.Основной.ТолькоПросмотр = Объект.ЭтоМатериалы;
	Если Объект.ЭтоМатериалы Тогда
		Объект.Основной = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура алсав_ТоварыВариантКомлектацииНачалоВыбораПосле(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	 
    Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Номенклатура) Тогда

        СтандартнаяОбработка = ЛОЖЬ;
		ПараметрыФормыВыбора = Новый Структура("Отбор", Новый Структура("Владелец", Элементы.Товары.ТекущиеДанные.Номенклатура));
		ПараметрыФормыВыбора.Вставить("РежимВыбора",Истина);
		ОткрытьФОрму("Справочник.ВариантыКомплектацииНоменклатуры.ФормаВыбора", ПараметрыФормыВыбора, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли   
КонецПроцедуры
